src/test/resources/com/gu/email/exacttarget/EmailListForUserRequest.xml

<soap:Envelope
        xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
        xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
        xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <soap:Header><wsse:Security soap:mustUnderstand="1">
        <wsse:UsernameToken wsu:Id="SecurityToken-884da619-59bb-4db6-834d-138322342442">
            <wsse:Username>XXXaccountNameXXX</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">XXXpasswordXXX</wsse:Password>
        </wsse:UsernameToken></wsse:Security>
    </soap:Header>
    <soap:Body><RetrieveRequestMsg xmlns="http://exacttarget.com/wsdl/partnerAPI">
        <RetrieveRequest>
            <ClientIDs>
                <ID>XXXbusinessUnitIdXXX</ID>
            </ClientIDs>
            <ObjectType>ListSubscriber</ObjectType>
            <Properties>SubscriberKey</Properties>
            <Properties>ListID</Properties>
            <Properties>Status</Properties>
            <Filter xmlns:ns1="http://exacttarget.com/wsdl/partnerAPI" xsi:type="ns1:ComplexFilterPart">
                <LeftOperand xsi:type="ns1:SimpleFilterPart">
                    <ns1:Property>SubscriberKey</ns1:Property>
                    <ns1:SimpleOperator>equals</ns1:SimpleOperator>
                    <ns1:Value>mrwibblywobbly@guardian.co.uk</ns1:Value>
                </LeftOperand>
                <LogicalOperator>AND</LogicalOperator>
                <RightOperand xsi:type="ns1:SimpleFilterPart">
                    <ns1:Property>Status</ns1:Property>
                    <ns1:SimpleOperator>equals</ns1:SimpleOperator>
                    <ns1:Value>Active</ns1:Value>
                </RightOperand>
            </Filter>
        </RetrieveRequest>
    </RetrieveRequestMsg>
    </soap:Body>
</soap:Envelope>
